alert("Біздің шағын ойынға қош келдіңіз!!");
alert("Ойын ережесі:" + "\n" + "Ойында барлық варианттарды санмен таңдау керек!!");
alert("Ескерту сіздің таңдауыңыздан ойын жаман немесе жақсы аяқталуы мүмкін");

var isName = prompt("Есіміңізді жазыңыз");

alert("Ал ендеше ойынды бастайық");
alert("Ойынның басы" + "\n" + "1)Сіз орманда адасып қалдыңыз" + "\n" + "2)Дала түн болатын");

var walk = prompt("Алдыңыздан екі жол шықты" + "\n" + "1)Оң жақа" + "\n" + "2)Сол жақа");
var end = "";
if (walk == "1") {
    alert("Сіздің алдыңыздан өзен пайда болды" + "\n" + "Өзен жағасында қайық болды" + "\n" + "Бірақ қайық сынып қалған болатын");

    var river = prompt("Сіздің таңдауыңз" + "\n" + "1)Қайықты қалпына келтіру" + "\n" + "2)Жүзіп өту");

    if (river == "1") {
        alert("Сіз қайықты қылпына келтіріп өзеннің арғы жағасын жүзіп өттіңіз");
        end += " жақсы аяқталды";
    } else if (river == "2") {
        alert("Өзеннің ағысы қатты болатын сіз батып кеттіңіз");
        end += " жаман аяқталды";
    } 
} else if (walk == "2") {
    alert ("Сіз аюдың апаныны тап болдыңыз" + "\n" + "Бірақ аю үңгірінде болмады");

    var bear = prompt("Сіздің таңдауыңз" + "\n" + "1)Үңгіргде қалу" + "\n" + "2)Үңгірді айналып өту");

    if (bear == "1") {
        alert("Аю үңгірге қайта оралды......");
        end += " жаман аяқталды";
    } else if (bear == "2") {
        alert("Кішкене жүрген соң алдыңыздан ауыл пайда болды" + "\n" + "Сол жақта түнеп шықтыңыз");
        end += " жақсы аяқталды";
    }
} 

alert(isName + " ойыны" + end);